#!/bin/bash
cpu=$(lscpu)
mem=$(free -h)
hdd=$(df -h)
linux=$(uname -a)
eth=$(ip addr show)
speed_eth=$(ethtool enp4s0 | grep -i speed)

echo "Инфа о системе: $linux"
echo "--------------------------------------------------------"
echo "Инфа о процессоре: $cpu"
echo "--------------------------------------------------------"
echo "Инфа о опер памяти: $mem"
echo "--------------------------------------------------------"
echo "Инфа о сетевых интерфейсах: $eth"
echo "--------------------------------------------------------"
echo "Инфа о скорости сетевого интерфейса enp4s0: $speed_eth"
echo "--------------------------------------------------------"
echo "Инфа о дисках: $hdd"
echo "--------------------------------------------------------"



